# Найдите сумму цифр трехзначного числа.
a = (input("введите трехзначное число:  "))
b = int (a[0])
c = int (a[1])
d = int (a[2])
summa = (b+c+d)
print(summa)
